Autodesk.Revit.DB.UnitUtils.GetTypeCatalogString(Autodesk.Revit.DB.DisplayUnitType)
Gets the string used in type catalogs to identify a given display unit.
displayUnit:
The display unit.
Returns:
The type catalog string, or an empty string if the display unit cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetTypeCatalogString(Autodesk.Revit.DB.UnitType)
Gets the string used in type catalogs to identify a given unit type.
unitType:
The unit type.
Returns:
The type catalog string, or an empty string if the unit type cannot be used in type catalogs.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetUnitGroup(Autodesk.Revit.DB.UnitType)
Gets the unit group for a given unit type.
unitType:
The unit type.
Returns:
The unit group.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetValidDisplayUnits(Autodesk.Revit.DB.UnitType)
Gets all valid display units for a given unit type.
unitType:
The unit type.
Returns:
The valid display units.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidDisplayUnit(Autodesk.Revit.DB.UnitType,Autodesk.Revit.DB.DisplayUnitType)
Checks whether a display unit is valid for a given unit type.
unitType:
The unit type.
displayUnit:
The display unit to check.
Returns:
True if the display unit is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetValidDisplayUnits
Gets all valid display units.
Remarks:
A display unit is considered valid if it is an actual unit like
meters or feet.  Obsolete values and the special values DUT_CUSTOM
and DUT_UNDEFINED are not considered valid.
Returns:
The valid display units.
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidDisplayUnit(Autodesk.Revit.DB.DisplayUnitType)
Checks whether a display unit is valid.
Remarks:
A display unit is considered valid if it is an actual unit like
meters or feet.  Obsolete values and the special values DUT_CUSTOM
and DUT_UNDEFINED are not considered valid.
displayUnit:
The display unit to check.
Returns:
True if the display unit is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.GetValidUnitTypes
Gets all valid unit types.
Remarks:
A unit type is considered valid if it is an actual unit type like
UT_Length or UT_Angle.  Obsolete values and the special values
UT_Custom and UT_Undefined are not considered valid.
Returns:
The valid unit types.
Since:
2014

Autodesk.Revit.DB.UnitUtils.IsValidUnitType(Autodesk.Revit.DB.UnitType)
Checks whether a unit type is valid.
Remarks:
A unit type is considered valid if it is an actual unit type like
UT_Length or UT_Angle.  Obsolete values and the special values
UT_Custom and UT_Undefined are not considered valid.
unitType:
The unit type to check.
Returns:
True if the unit type is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertToInternalUnits(System.Double,Autodesk.Revit.DB.DisplayUnitType)
Converts a value from a given display unit to Revit's internal units.
value:
The value to convert.
displayUnit:
The value's display unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.ConvertFromInternalUnits(System.Double,Autodesk.Revit.DB.DisplayUnitType)
Converts a value from Revit's internal units to a given display unit.
value:
The value to convert.
displayUnit:
The desired display unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.UnitUtils.Convert(System.Double,Autodesk.Revit.DB.DisplayUnitType,Autodesk.Revit.DB.DisplayUnitType)
Converts a value from one display unit to another, such as square feet to square meters.
value:
The value to convert.
currentDisplayUnit:
The current display unit.
desiredDisplayUnit:
The desired display unit.
Returns:
The converted value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not finite
-or-
currentDisplayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
-or-
desiredDisplayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
currentDisplayUnit and desiredDisplayUnit have different dimensions.
Since:
2014

Autodesk.Revit.DB.UnitUtils
A utility class of functions related to units.
Since:
2014